In [15]:
import pandas as pd
import numpy as np
import seaborn as sns
from matplotlib import pyplot as plt

In [16]:
dfc=pd.read_csv('Credit_card.csv')
dfl=pd.read_csv('Credit_card_label.csv')

In [17]:
dfc.head()

,Ind_ID,GENDER,Car_Owner,Propert_Owner,CHILDREN,Annual_income,Type_Income,EDUCATION,Marital_status,Housing_type,Birthday_count,Employed_days,Mobile_phone,Work_Phone,Phone,EMAIL_ID,Type_Occupation,Family_Members
0,5008827,M,Y,Y,0,180000.0,Pensioner,Higher education,Married,House / apartment,-18772.0,365243,1,0,0,0,NaN,2
1,5009744,F,Y,N,0,315000.0,Commercial associate,Higher education,Married,House / apartment,-13557.0,-586,1,1,1,0,NaN,2
2,5009746,F,Y,N,0,315000.0,Commercial associate,Higher education,Married,House / apartment,NaN,-586,1,1,1,0,NaN,2
3,5009749,F,Y,N,0,NaN,Commercial associate,Higher education,Married,House / apartment,-13557.0,-586,1,1,1,0,NaN,2
4,5009752,F,Y,N,0,315000.0,Commercial associate,Higher education,Married,House / apartment,-13557.0,-586,1,1,1,0,NaN,2

In [18]:
dfl.head()

    Ind_ID  label
0  5008827      1
1  5009744      1
2  5009746      1
3  5009749      1
4  5009752      1

In [19]:
mdf= pd.merge(dfc,dfl, on='Ind_ID', how='outer')

In [20]:
mdf.head()

,Ind_ID,GENDER,Car_Owner,Propert_Owner,CHILDREN,Annual_income,Type_Income,EDUCATION,Marital_status,Housing_type,Birthday_count,Employed_days,Mobile_phone,Work_Phone,Phone,EMAIL_ID,Type_Occupation,Family_Members,label
0,5008827,M,Y,Y,0,180000.0,Pensioner,Higher education,Married,House / apartment,-18772.0,365243,1,0,0,0,NaN,2,1
1,5008865,F,Y,Y,2,135000.0,Working,Secondary / secondary special,Married,House / apartment,-15761.0,-3173,1,0,0,0,Laborers,4,0
2,5008889,F,N,Y,0,247500.0,Commercial associate,Higher education,Separated,Rented apartment,-17016.0,-1347,1,0,0,0,Core staff,1,0
3,5009000,M,Y,Y,0,157500.0,Working,Secondary / secondary special,Married,House / apartment,-9927.0,-828,1,0,0,0,Drivers,2,0
4,5009023,F,N,Y,2,216000.0,State servant,Higher education,Married,House / apartment,-15444.0,-3112,1,0,0,1,NaN,4,0

In [21]:
mdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1548 entries, 0 to 1547
Data columns (total 19 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Ind_ID           1548 non-null   int64
 1   GENDER           1541 non-null   object
 2   Car_Owner        1548 non-null   object
 3   Propert_Owner    1548 non-null   object
 4   CHILDREN         1548 non-null   int64
 5   Annual_income    1525 non-null   float64
 6   Type_Income      1548 non-null   object
 7   EDUCATION        1548 non-null   object
 8   Marital_status   1548 non-null   object
 9   Housing_type     1548 non-null   object
 10  Birthday_count   1526 non-null   float64
 11  Employed_days    1548 non-null   int64
 12  Mobile_phone     1548 non-null   int64
 13  Work_Phone       1548 non-null   int64
 14  Phone            1548 non-null   int64
 15  EMAIL_ID         1548 non-null   int64
 16  Type_Occupation  1060 non-null   object
 17  Family_Members   1548 non-null   int64
 18  label            1548 non-null   int64
dtypes: float64(2), int64(9), object(8)
memory usage: 229.9+ KB

In [22]:
mdf.isnull().sum()

Ind_ID               0
GENDER               7
Car_Owner            0
Propert_Owner        0
CHILDREN             0
Annual_income       23
Type_Income          0
EDUCATION            0
Marital_status       0
Housing_type         0
Birthday_count      22
Employed_days        0
Mobile_phone         0
Work_Phone           0
Phone                0
EMAIL_ID             0
Type_Occupation    488
Family_Members       0
label                0
dtype: int64

In [23]:
mdf.columns

Index(['Ind_ID', 'GENDER', 'Car_Owner', 'Propert_Owner', 'CHILDREN',
       'Annual_income', 'Type_Income', 'EDUCATION', 'Marital_status',
       'Housing_type', 'Birthday_count', 'Employed_days', 'Mobile_phone',
       'Work_Phone', 'Phone', 'EMAIL_ID', 'Type_Occupation', 'Family_Members',
       'label'],
      dtype='object')

In [24]:
mdf['GENDER'].mode()

0    F
Name: GENDER, dtype: object

In [25]:
mdf['GENDER'].value_counts()

GENDER
F    973
M    568
Name: count, dtype: int64

In [26]:
mdf['GENDER'].fillna(mdf['GENDER'].mode()[0], inplace=True)

C:\Users\abili\AppData\Local\Temp\ipykernel_4940\161765425.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  mdf['GENDER'].fillna(mdf['GENDER'].mode()[0], inplace=True)

In [27]:
mdf['GENDER'].isnull().sum()

np.int64(0)

In [28]:
mdf['Type_Occupation'].mode()

0    Laborers
Name: Type_Occupation, dtype: object

In [29]:
mdf['Type_Occupation'].value_counts()

Type_Occupation
Laborers                 268
Core staff               174
Managers                 136
Sales staff              122
Drivers                   86
High skill tech staff     65
Medicine staff            50
Accountants               44
Security staff            25
Cleaning staff            22
Cooking staff             21
Private service staff     17
Secretaries                9
Low-skill Laborers         9
Waiters/barmen staff       5
HR staff                   3
Realty agents              2
IT staff                   2
Name: count, dtype: int64

In [30]:
mdf['Type_Occupation'].fillna(mdf['Type_Occupation'].mode()[0], inplace=True)

C:\Users\abili\AppData\Local\Temp\ipykernel_4940\1967694582.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  mdf['Type_Occupation'].fillna(mdf['Type_Occupation'].mode()[0], inplace=True)

In [31]:
mdf['Type_Occupation'].isnull().sum()

np.int64(0)

In [32]:
mdf.Annual_income.mean().round()

np.float64(191399.0)

In [33]:
mdf['Annual_income'].fillna(mdf['Annual_income'].mean().round(),inplace=True)

C:\Users\abili\AppData\Local\Temp\ipykernel_4940\3445382301.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  mdf['Annual_income'].fillna(mdf['Annual_income'].mean().round(),inplace=True)

In [34]:
mdf['Annual_income'].isnull().sum()

np.int64(0)

In [35]:
mdf.Birthday_count.isnull().sum()

np.int64(22)

In [36]:
mdf['Birthday_count'].fillna(mdf['Birthday_count'].mean().round(),inplace=True)

C:\Users\abili\AppData\Local\Temp\ipykernel_4940\3375305059.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  mdf['Birthday_count'].fillna(mdf['Birthday_count'].mean().round(),inplace=True)

In [37]:
mdf.Birthday_count.isnull().sum()

np.int64(0)

In [38]:
def counts(day):
  return round(np.abs(day/365))

In [39]:
mdf['experience']=mdf['Employed_days'].apply(lambda x: counts(x) if x<0 else 0)

In [40]:
mdf['age']=mdf['Birthday_count'].apply(counts)

In [41]:
mdf.head()

,Ind_ID,GENDER,Car_Owner,Propert_Owner,CHILDREN,Annual_income,Type_Income,EDUCATION,Marital_status,Housing_type,...,Employed_days,Mobile_phone,Work_Phone,Phone,EMAIL_ID,Type_Occupation,Family_Members,label,experience,age
0,5008827,M,Y,Y,0,180000.0,Pensioner,Higher education,Married,House / apartment,...,365243,1,0,0,0,Laborers,2,1,0,51
1,5008865,F,Y,Y,2,135000.0,Working,Secondary / secondary special,Married,House / apartment,...,-3173,1,0,0,0,Laborers,4,0,9,43
2,5008889,F,N,Y,0,247500.0,Commercial associate,Higher education,Separated,Rented apartment,...,-1347,1,0,0,0,Core staff,1,0,4,47
3,5009000,M,Y,Y,0,157500.0,Working,Secondary / secondary special,Married,House / apartment,...,-828,1,0,0,0,Drivers,2,0,2,27
4,5009023,F,N,Y,2,216000.0,State servant,Higher education,Married,House / apartment,...,-3112,1,0,0,1,Laborers,4,0,9,42

In [42]:
mdf.isnull().sum()

Ind_ID             0
GENDER             0
Car_Owner          0
Propert_Owner      0
CHILDREN           0
Annual_income      0
Type_Income        0
EDUCATION          0
Marital_status     0
Housing_type       0
Birthday_count     0
Employed_days      0
Mobile_phone       0
Work_Phone         0
Phone              0
EMAIL_ID           0
Type_Occupation    0
Family_Members     0
label              0
experience         0
age                0
dtype: int64

In [43]:
df_cc=mdf.copy()

In [44]:
df_cc.to_csv('df_cc',index=False)

In [45]:
c=['Ind_ID','Birthday_count','Employed_days','Mobile_phone','Work_Phone',	'Phone','EMAIL_ID']
mdf=mdf.drop(columns=c)

In [46]:
mdf.head()

,GENDER,Car_Owner,Propert_Owner,CHILDREN,Annual_income,Type_Income,EDUCATION,Marital_status,Housing_type,Type_Occupation,Family_Members,label,experience,age
0,M,Y,Y,0,180000.0,Pensioner,Higher education,Married,House / apartment,Laborers,2,1,0,51
1,F,Y,Y,2,135000.0,Working,Secondary / secondary special,Married,House / apartment,Laborers,4,0,9,43
2,F,N,Y,0,247500.0,Commercial associate,Higher education,Separated,Rented apartment,Core staff,1,0,4,47
3,M,Y,Y,0,157500.0,Working,Secondary / secondary special,Married,House / apartment,Drivers,2,0,2,27
4,F,N,Y,2,216000.0,State servant,Higher education,Married,House / apartment,Laborers,4,0,9,42

In [47]:
mdf.label.value_counts()

label
0    1373
1     175
Name: count, dtype: int64

In [48]:
imbalance_ratio=mdf.label.value_counts()[0]/mdf.label.value_counts()[1]
print('Imbalance ratio: ',imbalance_ratio)

Imbalance ratio:  7.845714285714286

In [49]:
#cat and numerical variable seperation
cat= mdf.select_dtypes(include=['object']).columns
num= mdf.select_dtypes(include=['int32','int64','float32','float64']).columns

In [50]:
cat

Index(['GENDER', 'Car_Owner', 'Propert_Owner', 'Type_Income', 'EDUCATION',
       'Marital_status', 'Housing_type', 'Type_Occupation'],
      dtype='object')

In [51]:
from scipy.stats import chi2_contingency

In [52]:
categorical_features = ['GENDER', 'Car_Owner', 'Propert_Owner', 'Type_Income', 'EDUCATION','Marital_status', 'Housing_type', 'Type_Occupation']

results = {}
for feature in categorical_features:
    contingency_table = pd.crosstab(mdf[feature], mdf['label'])
    chi2, p, _, _ = chi2_contingency(contingency_table)
    results[feature] = (chi2, p)
    print(f'Chi-Square test for {feature}: chi2 = {chi2}, p-value = {p}')

Chi-Square test for GENDER: chi2 = 2.935630436512684, p-value = 0.08664483091132888
Chi-Square test for Car_Owner: chi2 = 0.24788350240956675, p-value = 0.6185693269675412
Chi-Square test for Propert_Owner: chi2 = 0.38467918054883476, p-value = 0.5351095955412992
Chi-Square test for Type_Income: chi2 = 13.598555653674126, p-value = 0.0035057839285808816
Chi-Square test for EDUCATION: chi2 = 9.205670423908046, p-value = 0.056159329722052835
Chi-Square test for Marital_status: chi2 = 10.524107710165312, p-value = 0.03246652787478729
Chi-Square test for Housing_type: chi2 = 28.04279521603185, p-value = 3.570429275146809e-05
Chi-Square test for Type_Occupation: chi2 = 36.56584762842536, p-value = 0.003851575952868713

In [53]:
num

Index(['CHILDREN', 'Annual_income', 'Family_Members', 'label', 'experience',
       'age'],
      dtype='object')

In [54]:
ncol=mdf[['CHILDREN', 'Annual_income', 'Family_Members', 'label', 'experience','age']]
ncol.corr()

,CHILDREN,Annual_income,Family_Members,label,experience,age
CHILDREN,1.000000,0.078111,0.890248,-0.021646,0.073313,-0.276852
Annual_income,0.078111,1.000000,0.050677,0.026875,0.051519,-0.109767
Family_Members,0.890248,0.050677,1.000000,-0.030709,0.092535,-0.263470
label,-0.021646,0.026875,-0.030709,1.000000,-0.095189,0.044841
experience,0.073313,0.051519,0.092535,-0.095189,1.000000,-0.022627
age,-0.276852,-0.109767,-0.263470,0.044841,-0.022627,1.000000

In [55]:
mdf=mdf.drop(columns=['CHILDREN'])

In [56]:
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import OneHotEncoder
from sklearn.model_selection import train_test_split
from sklearn.feature_selection import RFE
from sklearn import metrics
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import precision_score, recall_score , f1_score, confusion_matrix

In [57]:
mdf['label'].dtypes

dtype('int64')

In [58]:
df=mdf.copy()

In [59]:
df=mdf[['Annual_income', 'age','experience','Type_Income', 'Type_Occupation','Marital_status', 'Housing_type','label']]
df.head()

,Annual_income,age,experience,Type_Income,Type_Occupation,Marital_status,Housing_type,label
0,180000.0,51,0,Pensioner,Laborers,Married,House / apartment,1
1,135000.0,43,9,Working,Laborers,Married,House / apartment,0
2,247500.0,47,4,Commercial associate,Core staff,Separated,Rented apartment,0
3,157500.0,27,2,Working,Drivers,Married,House / apartment,0
4,216000.0,42,9,State servant,Laborers,Married,House / apartment,0

In [60]:
x=df.drop(columns=['label'])
y=df['label']

In [61]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.15,random_state=0)

In [62]:
cat_var=['Type_Income', 'Type_Occupation','Marital_status', 'Housing_type']
num_var=['Annual_income', 'Family_Members', 'label','experience', 'age']

In [63]:
encode= ColumnTransformer(transformers=[('ohe',OneHotEncoder(sparse_output=False,drop='first'), cat_var)],remainder='passthrough')

m3_RF=RandomForestClassifier(class_weight='balanced', random_state=0)
n=5
rfe=RFE(m3_RF,n_features_to_select=n)
pipe_RF=Pipeline([('encoding', encode),('model_3',rfe)])
pipe_RF.fit(x_train,y_train)

y_pred=pipe_RF.predict(x_test)

print('Precision- ', metrics.precision_score(y_test,y_pred))
print('Recall- ', metrics.recall_score(y_test,y_pred))
print('F1 Score- ',f1_score(y_test,y_pred))
print('ROC- ',metrics.roc_auc_score(y_test,y_pred))
print('Confusion Matrix- ',confusion_matrix(y_test,y_pred))

Precision-  0.55
Recall-  0.4782608695652174
F1 Score-  0.5116279069767442
ROC-  0.7177018633540373
Confusion Matrix-  [[201   9]
 [ 12  11]]

In [64]:
x.head()

,Annual_income,age,experience,Type_Income,Type_Occupation,Marital_status,Housing_type
0,180000.0,51,0,Pensioner,Laborers,Married,House / apartment
1,135000.0,43,9,Working,Laborers,Married,House / apartment
2,247500.0,47,4,Commercial associate,Core staff,Separated,Rented apartment
3,157500.0,27,2,Working,Drivers,Married,House / apartment
4,216000.0,42,9,State servant,Laborers,Married,House / apartment

In [65]:
input=x.iloc[0]

In [66]:
ip_df=pd.DataFrame(input).T

In [67]:
ip_df

,Annual_income,age,experience,Type_Income,Type_Occupation,Marital_status,Housing_type
0,180000.0,51,0,Pensioner,Laborers,Married,House / apartment

In [68]:
pipe_RF.predict(ip_df)

array([1])

In [69]:
y.iloc[0]

np.int64(1)

In [70]:
import pickle

In [71]:
pickle.dump(pipe_RF,open('rfmodel.pkl','wb'))

In [72]:
pickle_model=pickle.load(open('rfmodel.pkl','rb'))

In [73]:
pickle_model.predict(ip_df)

array([1])